<template>
  <div class="privacyAgreenment">
    <div class="tab">
      <i class="iconfont icon-left" @click="$router.go(-1)"></i>
      <p>怀南会用户隐私协议</p>
      <i class="iconfont icon-left" style="visibility:hidden;"></i>
    </div>
    <div class="content">
      <p>您好！欢迎您使用怀南会电子商务平台！</p>
      <p>为了更好地为您提供服务，请您仔细阅读这份协议。本协议是您与本平台就您登录本平台进行注册及使用等所涉及的全部行为所订立的权利义务规范。您在注册过程中点击“注册”等按钮、及注册后登录和使用时，均表明您已完全同意并接受本协议，愿意遵守本协议的各项规则、规范的全部内容，若不同意则可停止注册或使用本平台。如您是未成年人，您还应要求您的监护人仔细阅读本协议，并取得他/他们的同意。</p>
      <p>
        以下隐私协议是本平台对用户隐私保护的许诺，请您务必仔细阅读本协议，以了解我们关于管理您个人信息的情况。本隐私协议的全部条款属于本平台用户服务协议的重要部份之一。
        <br />为提高用户的使用感受和满意度，用户同意本平台将基于用户的操作行为对用户数据进行调查研究和分析，从而进一步优化服务。但在未征得您许可的情况下，不会将这些信息对外公开或向第三方提供。
      </p>
      <p>
        1. 保有您提供的信息
        <br />1.1本平台会在您自愿选择服务或提供信息的情况下收集您的个人信息，并将这些信息进行整合，以便向您提供更好的用户服务。请您在注册时及时、详尽及准确的提供个人资料，并不断更新注册资料，符合及时、详尽准确的要求。所有原始键入的资料将引用为注册资料。如果因注册信息不真实而引起的问题，由您自行承担相应的后果。请您不要将您的帐号、密码转让或出借予他人使用。如您发现您的帐号遭他人非法使用，应立即通知本平台。因非法行为或用户的保管疏忽导致帐号、密码遭他人非法使用，本软平台不承担责任。
      </p>
      <p>
        2.保有您的使用记录
        <br />2.1当您使用本平台的服务时，服务器会自动记录一些信息，包括手机型号、IP地址等。在如下情况下，本平台会遵照您的意愿或法律的规定披露您的个人信息，由此引发的问题将由您个人承担：
        <br />（1）事先获得您的授权；
        <br />（2）只有提供您的个人资料，才能提供您所要求的产品和服务；
        <br />（3）根据有关的法律法规要求；
        <br />（4）按照相关政府主管部门的要求；
        <br />（5）为维护本平台的合法权益。
        <br />（6）您同意让第三方共享资料。
        <br />（7）我们发现您违反了本软件的服务条款或使用规定。
        <br />2.2本平台可能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与本社区同等的保护用户隐私的责任，则本社区有权将用户的注册资料等信息提供给该第三方，并无须另行告知用户。
        <br />2.3在不透露单个用户隐私资料的前提下，本平台有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。
      </p>
      <p>
        3.本协议不适用于以下情况：
        <br />3.1通过我们的服务而接入的第三方服务（包括任何第三方网站）而被收集的信息。本协议仅适用于我们平台内所收集的信息，并不适用于任何第三方提供的服务或第三方的信息使用规则，我们对任何第三方使用由您提供的信息不承担任何责任；
        <br />3.2通过在我们服务中进行广告服务的其他公司或机构所收集的信息。
      </p>
      <p>
        4.责任声明
        <br />4.1 任何网站、单位或者个人如认为本平台或者本平台提供的相关内容涉嫌侵犯其合法权益，应及时向本平台提供书面权力通知，并提供身份证明、权属证明及详细侵权情况证明。本平台在收到上述法律文件后，将会尽快切断相关内容以保证相关网站、单位或者个人的合法权益得到保障。
        <br />4.2用户明确同意其使用本平台网络服务所存在的风险及一切后果将完全由用户本人承担，本平台对此不承担任何责任。
        <br />4.3本平台无法保证网络服务一定能满足用户的要求，也不保证网络服务的及时性、安全性、准确性。
        <br />4.4本平台不保证为方便用户而设置的外部链接的准确性和完整性，同时，对于该等外部链接指向的不由本平台实际控制的任何网页上的内容，本平台不承担任何责任。
      </p>
      <p>
        5.知识产权
        <br />5.1 本平台特有的标识、版面设计、编排方式等版权均属本平台享有，未经本平台许可授权，不得任意复制或转载。
        <br />5.2 用户从本平台的服务中获得的信息，未经本平台的许可，不得任意复制或转载。
        <br />5.3 用户承诺对其发表或者上传于本平台的所有信息(即属于《中华人民共和国著作权法》规定的作品，包括但不限于文字、图片、音乐、电影、表演和录音录像制品和电脑程序等)均享有完整的知识产权，或者已经得到相关权利人的合法授权；如用户违反本条规定造成本平台被第三人索赔的，用户应全额补偿本平台的一切费用(包括但不限于各种赔偿费、诉讼代理费及为此支出的其它合理费用)。
        <br />5.4 本平台所有用户上传内容仅代表用户自己的立场和观点，与本平台无关，由作者本人承担一切法律责任。
        <br />5.5当第三方认为用户发表或者上传于本平台的信息侵犯其权利，并根据《信息网络传播权保护条例》或者相关法律规定向本平台发送权利通知书时，用户同意本平台可以自行判断决定删除涉嫌侵权信息，除非用户提交书面证据材料排除侵权的可能性，本平台将不会自动恢复上述删除的信息。
        <br />5.6上述及其他任何本服务包含的内容的知识产权均受到法律保护，未经本平台、用户或相关权利人书面许可，任何人不得以任何形式进行使用或创造相关衍生作品。
        <br />5.7如用户在使用网络服务时违反下述任何规定，本平台有权要求用户改正或直接采取一切必要的措施(包括但不限于删除用户上传的内容、暂停或终止用户使用网络服务的权利)以减轻用户不当行为而造成的影响。
        <br />（1）不得为任何非法目的而使用平台服务系统；
        <br />（2）遵守所有与本平台服务有关的协议、规定和程序；
        <br />（3）不得利用本平台的服务进行任何可能对互联网的正常运转造成不利影响的行为；
        <br />（4） 不得利用本平台服务进行任何不利于本平台的行为。
      </p>
      <p>
        6.隐私协议的修订
        <br />我们可能适时修订本协议的条款，修订后的条款也是构成本协议的一部分。如修订造成您在本协议下权利的实质减少，我们将在修订生效前通过在主页上显著位置提示或向您发送电子邮件或以其他方式通知您。在该种情况下，若您继续使用我们的服务，即表示同意受经修订的本协议的约束。
      </p>
      <p>
        7.通知送达
        <br />7.1本协议项下本平台对于用户所有的通知均可通过网页公告、电子邮件、系统通知、微博管理帐号主动联系、私信、手机短信或常规的信件传送等方式进行；该等通知于发送之日视为已送达收件人。
        <br />7.2用户对于本平台的通知应当通过本平台对外正式公布的通信地址、电子邮件地址等联系信息进行送达。
      </p>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {};
  }
};
</script>

<style scoped>
.privacyAgreenment {
  background: #fff;
  position: absolute;
  top: 0;
  left: 0;
  width: 100%;
  height: 100%;
  padding-top: 1.2rem;
  overflow-y: auto;
  overflow-x: hidden;
  color: #1c0000;
}
/* 标签栏 */
.privacyAgreenment .tab {
  height: 1.2144rem;
  width: 100%;
  display: flex;
  align-items: center;
  padding: 0 0.4rem;
  box-sizing: border-box;
  background: #fff;
  justify-content: space-between;
  position: fixed;
  top: 0;
  left: 0;
  z-index: 11;
  box-shadow: 0 0.0399rem 0.0798rem rgba(190, 190, 190, 0.1);
}
.privacyAgreenment .tab > i {
  font-size: 0.399rem;
  color: #9a9a9a;
}
.privacyAgreenment .tab > p {
  font-size: 0.4256rem;
  font-weight: 500;
}
/* 内容 */
.content {
  padding: 0.3325rem 0.5054rem 0;
  font-size: 0.4rem;
  line-height: 0.6rem;
}
.content p {
  margin-bottom: 0.8rem;
}
</style>