<template>
  <div class="loginAgreement">
    <div class="tab">
      <i class="iconfont icon-left" @click="$router.go(-1)"></i>
      <p>用户登录注册协议</p>
      <i class="iconfont icon-left" style="visibility:hidden;"></i>
    </div>
    <div class="content">
      <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;请务必认真阅读和理解本《用户登录注册协议》（以下简称《协议》）中所规定的权利和限制。除非您接受本《协议》条款，否则您无权注册、登录或使用本协议所涉及的相关服务。您一旦注册、登录、使用或以任何方式使用本《协议》所涉及的相关服务行为将被视为对本《协议》的接受，即表示您同意接受本《协议》各项条款的约束。如果您不同意本《协议》中的条款，请不要注册、登录或使用本《协议》相关服务。本《协议》是用户与常州怀南汇商务服务有限公司之间的协议，具有合同效力。</p>
      <p>
        一、注册协议须知：
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;本《协议》内容包括协议正文及所有怀南会平台已经发布的或将来可能发布的各类规则。所有规则被视为《协议》不可分割的一部分，与《协议》正文具有同等的合同效力，受法律保护。
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;用户在使用怀南会平台提供的各项服务的同时，承诺接受并遵守各项相关规则的规定。怀南会有权根据需要不时地制定、修改本协议或各类规则，如本协议有任何变更，怀南会将在网站上刊登公告，通知用户。如果用户不同意相关变更，必须立即停止使用服务。经修订的协议一经在怀南会网站公布后，立即自动生效。各类规则会在发布后生效，亦成为本协议的一部分。登录或继续使用服务将表示用户接受经修订的《协议》。除另行明确声明外，任何使“服务”范围扩大或功能增强的新内容均受本《协议》约束。
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;用户确认本《协议》后，本协议即在用户和怀南会之间产生法律效力。请用户务必在注册之前认真阅读全部协议内容，如有任何疑问，可向怀南会咨询。（1）无论用户事实上是否在注册之前认真阅读了本服务协议，只要用户点击协议正本下方的“确认”按钮并按照注册程序成功注册为用户，用户行为仍然表示其同意并签署了本服务协议。（2）本协议不涉及用户与其他怀南会用户之间因网上交易而产生的法律关系及法律纠纷。
      </p>
      <p>
        二、定义：
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;怀南会电子商务平台：有关怀南会网站和APP上交易平台上的术语或图示的含义，详见怀南会帮助，或咨询怀南会客服。
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;用户及用户注册：用户必须是具备完全民事行为能力的自然人，或者是具有合法经营资格的实体组织。无民事行为能力人、限制民事行为能力人以及无经营或特定经营资格的组织不当注册为怀南会用户或超过其民事权利或行为能力范围从事交易的，其与怀南会之间的服务协议自始无效，怀南会一经发现，有权立即注销该用户，并追究其使用怀南会服务的一切法律责任。用户注册是指用户登陆怀南会网站和APP，并按要求填写相关信息并确认同意履行相关用户协议的过程。用户因进行交易、获取有偿服务或接触怀南会服务器而发生的所有应纳税赋，以及一切硬件、软件、服务及其它方面的费用均由用户负责支付。
      </p>
      <p>
        三、用户权力和义务：
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;用户有权利拥有自己在怀南会的用户名及交易密码，并有权利使用自己的用户名及密码随时登陆怀南会平台和APP。用户不得以任何形式擅自转让或授权他人使用自己的怀南会用户名及密码，共享账号引起的任何损失怀南会概不负责；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;用户有权根据本服务协议的规定以及怀南会网站和APP上发布的相关规则利用怀南会电子商务平台查询物品信息、购买物品、发布交易信息、登录物品、参加网上物品竞买、与其它用户订立物品买卖合同、评价其它用户的信用、参加怀南会的有关活动以及有权享受怀南会提供的其它的有关信息服务；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;用户在怀南会交易过程中如与其他用户因交易产生纠纷，可以请求怀南会从中予以协调。用户如发现其他用户有违法或违反本服务协议的行为，可以向怀南会进行反映要求处理。如用户因网上交易与其他用户产生诉讼的，用户有权通过司法部门要求怀南会提供相关资料；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;用户有义务在注册时提供自己的真实资料，并保证诸如电子邮件地址、联系电话、联系地址、邮政编码等内容的有效性及安全性，保证怀南会及其他用户可以通过上述联系方式与自己进行联系。同时，用户也有义务在相关资料实际变更时及时更新有关注册资料。用户保证不以他人资料在怀南会进行注册或认证；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;用户应当保证在使用怀南会电子商务平台进行交易过程中遵守诚实信用的原则，不在交易过程中采取不正当竞争行为，不扰乱网上交易的正常秩序，不从事与网上交易无关的行为；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;用户不应在怀南会平台上恶意评价其他用户，或采取不正当手段提高自身的信用度或降低其他用户的信用度；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;用户在怀南会平台上不得发布各类违法或违规信息；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;用户在怀南会平台上不得买卖国家禁止销售的或限制销售的物品、不得买卖侵犯他人知识产权或其它合法权益的物品，也不得买卖违背社会公共利益或公共道德的、或是怀南会认为不适合在怀南会平台和APP上销售的物品。具体内容详见《禁止和限制销售物品规则》；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;用户承诺自己在使用怀南会时实施的所有行为均遵守国家法律、法规和怀南会的相关规定以及各种社会公共利益或公共道德。如有违反导致任何法律后果的发生，用户将以自己的名义独立承担所有相应的法律责任；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;用户同意，不对怀南会上任何数据作商业性利用，包括但不限于在未经怀南会事先书面批准的情况下，以复制、传播等方式使用在怀南会网站和APP上展示的任何资料。
      </p>
      <p>
        四、怀南会的权利和义务：
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;怀南会有义务在现有技术上维护整个电子商务平台的正常运行，并努力提升和改进技术，使用户网上交易活动得以顺利进行；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;对用户在注册使用怀南会平台和APP过程中所遇到的与交易或注册有关的问题及反映的情况，怀南会应及时作出回复；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;对于用户在怀南会平台和APP上的不当行为或其它任何怀南会认为应当终止服务的情况，怀南会有权随时作出删除相关信息、终止服务提供等处理，而无须征得用户的同意；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;因电子商务平台的特殊性，怀南会没有义务对所有用户的注册数据、所有的交易行为以及与交易有关的其它事项进行事先审查，但如存在下列情况：
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;①用户或其它第三方通知怀南会，认为某个具体用户或具体交易事项可能存在重大问题；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;②用户或其它第三方向怀南会告知交易平台上有违法或不当行为的，怀南会以普通非专业交易者的知识水平标准对相关内容进行判别，可以明显认为这些内容或行为具有违法或不当性质的；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;怀南会有权根据不同情况选择保留或删除相关信息或继续、停止对该用户提供服务，并追究相关法律责任。
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;用户在怀南会交易过程中如与其它用户因交易产生纠纷，请求怀南会从中予以调处，经怀南会审核后，怀南会有权通过电子邮件联系向纠纷双方了解情况，并将所了解的情况通过电子邮件互相通知对方；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;用户因在怀南会交易与其它用户产生诉讼的，用户通过司法部门或行政部门依照法定程序要求怀南会提供相关数据，怀南会应积极配合并提供有关资料；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;怀南会有权对用户的注册数据及交易行为进行查阅，发现注册数据或交易行为中存在任何问题或怀疑，均有权向用户发出询问及要求改正的通知或者直接作出删除等处理；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;经国家生效法律文书或行政处罚决定确认用户存在违法行为，或者怀南会有足够事实依据可以认定用户存在违法或违反服务协议行为的，怀南会有权在怀南会平台、APP及其他网站上以网络发布形式公布用户的违法行为；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;对于用户在怀南会平台发布的下列各类信息，怀南会有权在不通知用户的前提下进行删除或采取其它限制性措施，包括但不限于以规避费用为目的的信息；以炒作信用为目的的信息；怀南会有理由相信存在欺诈等恶意或虚假内容的信息；怀南会有理由相信与网上交易无关或不是以交易为目的的信息；怀南会有理由相信存在恶意竞价或其它试图扰乱正常交易秩序因素的信息；怀南会有理由相信该信息违反公共利益或可能严重损害怀南会和其它用户合法利益的；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;许可使用权：
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;用户以此授予怀南会及其关联公司独家的、全球通用的、永久的、免费的许可使用权利 （并有权在多个层面对该权利进行再授权），使怀南会及其关联公司有权（全部或部份地）使用、复制、修订、改写、发布、翻译、分发、执行和展示用户的全部资料数据（包括但不限于注册资料、交易行为数据及全部展示于网站的各类信息）或制作其派生作品，和/或以现在已知或日后开发的任何形式、媒体或技术，将上述信息纳入其它作品内；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;怀南会将在用户的计算机上设定或取用怀南会相关cookies，怀南会允许那些在怀南会平台上发布广告的公司到用户计算机上设定或取用 cookies，怀南会使用cookies为用户提供个性化服务。如果拒绝所有cookies，用户将不能使用需要登录的怀南会账号及服务内容。
      </p>
      <p>
        五、服务中断和终止：
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;用户同意，在怀南会未向用户收取服务费的情况下，怀南会可自行全权决定以任何理由 （包括但不限于怀南会认为用户已违反本协议的字面意义和精神，或以不符合本协议的字面意义和精神的方式行事，或用户在超过90天的时间内未以用户的账号及密码登录网站等） 终止用户的服务密码、账户（或其任何部份）或用户对服务的使用，并删除（不再保存）用户在使用服务中提交的任何资料。同时怀南会可自行全权决定，在发出通知或不发出通知的情况下，随时停止提供“服务”或其任何部分。账号终止后，怀南会没有义务为用户保留原账号中或与之相关的任何信息，或转发任何未曾阅读或发送的信息给用户或第三方。此外，用户同意，怀南会不就终止用户接入服务而对用户或任何第三者承担任何责任；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;如用户向怀南会提出注销怀南会注册用户身份时，经怀南会审核同意，由怀南会注销该注册用户，用户即解除与怀南会的服务协议关系。但注销该用户账号后，怀南会仍保留下列权利：
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;①用户注销后，怀南会有权保留该用户的注册数据及以前的交易行为记录。
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;②用户注销后，如用户在注销前在怀南会平台上存在违法行为或违反合同的行为，怀南会仍可行使本服务协议所规定的权利；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;在下列情况下，怀南会可以通过注销用户的方式终止服务：
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;①在用户违反本服务协议相关规定时，怀南会有权终止向该用户提供服务。怀南会将在中断服务时通知用户。但如该用户在被怀南会终止提供服务后，再一次直接或间接或以他人名义注册为怀南会用户的，怀南会有权再次单方面终止向该用户提供服务；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;②如怀南会通过用户提供的信息与用户联系时，发现用户在注册时填写的电子邮箱已不存在或无法接收电子邮件的，经怀南会以其它联系方式通知用户更改，而用户在三个工作日内仍未能提供新的电子邮箱地址的，怀南会有权终止向该用户提供服务；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;③一旦怀南会发现用户注册数据中主要内容是虚假的，怀南会有权随时终止向该用户提供服务；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;④本服务协议终止或更新时，用户明示不愿接受新的服务协议的；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;⑤其它怀南会认为需终止服务的情况。
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;服务中断、终止之前用户交易行为的处理因用户违反法律法规或者违反服务协议规定而致使怀南会中断、终止对用户服务的，对于服务中断、终止之前用户交易行为依下列原则处理：
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;①服务中断、终止之前，用户已经上传至怀南会的物品尚未交易或尚未交易完成的，怀南会有权在中断、终止服务的同时删除此项物品的相关信息；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;②服务中断、终止之前，用户已经就其它用户出售的具体物品作出要约，但交易尚未结束，怀南会有权在中断或终止服务的同时删除该用户的相关要约；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;③服务中断、终止之前，用户已经与另一用户就具体交易达成一致，怀南会可以不删除该项交易，但怀南会有权在中断、终止服务的同时将用户被中断或终止服务的情况通知用户的交易对方。
      </p>
      <p>
        六、责任范围：
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;用户明确理解和同意，怀南会不对因下述任一情况而导致的任何损害赔偿承担责任，包括但不限于利润、商誉、使用、数据等方面的损失或其它无形损失的损害赔偿 (无论怀南会是否已被告知该等损害赔偿的可能性)：
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;第三方未经批准的接入或第三方更改用户的传输数据或数据；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;第三方对“服务”的声明或关于“服务”的行为；或非因怀南会的原因而引起的与“服务”有关的任何其它事宜，包括疏忽。
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;用户明确理解并同意，如因其违反有关法律或者本协议之规定，使怀南会遭受任何损失，受到任何第三方的索赔，或任何行政管理部门的处罚，用户应对怀南会提供补偿，包括合理的律师费用。
      </p>
      <p>
        七、隐私权政策：
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;适用范围：
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;①在用户注册怀南会账户时，用户根据怀南会要求提供的个人注册信息；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;②在用户使用怀南会服务，参加怀南会活动，或访问怀南会平台和APP时，怀南会自动接收并记录的用户浏览器上的服务器数值，包括但不限于IP地址等数据及用户要求取用的网页记录；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;③怀南会收集到的用户在怀南会进行交易的有关数据，包括但不限于出价、购买、物品登录、信用评价及违规记录；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;④怀南会通过合法途径从商业伙伴处取得的用户个人数据。
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;信息使用：
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;①怀南会不会向任何人出售或出借用户的个人信息，除非事先得到用户的许可。
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;②怀南会亦不允许任何第三方以任何手段收集、编辑、出售或者无偿传播用户的个人信息。任何用户如从事上述活动，一经发现，怀南会有权立即终止与该用户的服务协议，查封其账号。
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;③为服务用户的目的，怀南会可能通过使用用户的个人信息，向用户提供服务，包括但不限于向用户发出产品和服务信息，或者与怀南会合作伙伴共享信息以便他们向用户发送有关其产品和服务的信息（后者需要用户的事先同意）。
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;信息披露：
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;用户的个人信息将在下述情况下部分或全部被披露：
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;①经用户同意，向第三方披露；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;②如用户是合资格的知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能的权利纠纷；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;③根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;④如果用户出现违反中国有关法律或者网站政策的情况，需要向第三方披露；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;⑤为提供你所要求的产品和服务，而必须和第三方分享用户的个人信息；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;⑥其它怀南会根据法律或者网站政策认为合适的披露；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;⑦在怀南会平台上创建的某一交易中，如交易任何一方履行或部分履行了交易义务并提出信息披露请求的， 怀南会有全权可以决定向该用户提供其交易对方的联络方式等必要信息，以促成交易的完成或纠纷的解决。
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;信息安全：
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;①怀南会账户有安全保护功能，请妥善保管用户的账户及密码信息；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;②在使用怀南会服务进行网上交易时，用户不可避免的要向交易对方或潜在的交易对方提供自己的个人信息，如联络方式或者邮政地址。请用户妥善保护自己的个人信息，仅在必要的情形下向他人提供；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;③如果用户发现自己的个人信息泄密，尤其是怀南会账户及密码发生泄露，请用户立即联络怀南会客服，以便怀南会采取相应措施。
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Cookie的使用：
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;①通过怀南会所设Cookie所取得的有关信息，将适用本政策；
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;②在怀南会上发布广告的公司通过广告在用户计算机上设定的Cookies，将按其自己的隐私权政策使用。
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;编辑和删除个人信息的权限：
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;用户可以点击个人中心对用户的个人信息进行编辑和删除，除非怀南会另有规定。
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;政策修改：
        <br />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;怀南会保留对本政策作出不时修改的权利。
      </p>
      <p>管辖：本《条款》之解释与适用，以及与本《条款》有关的争议，均应依照中华人民共和国法律予以处理，并以江苏省常州市钟楼区人民法院为第一审管辖法院。</p>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {};
  }
};
</script>

<style scoped>
.loginAgreement {
  background: #fff;
  position: absolute;
  top: 0;
  left: 0;
  width: 100%;
  height: 100%;
  padding-top: 1.2rem;
  overflow-y: auto;
  overflow-x: hidden;
  color: #1c0000;
}
/* 标签栏 */
.loginAgreement .tab {
  height: 1.2144rem;
  width: 100%;
  display: flex;
  align-items: center;
  padding: 0 0.4rem;
  box-sizing: border-box;
  background: #fff;
  justify-content: space-between;
  position: fixed;
  top: 0;
  left: 0;
  z-index: 11;
  box-shadow: 0 0.0399rem 0.0798rem rgba(190, 190, 190, 0.1);
}
.loginAgreement .tab > i {
  font-size: 0.399rem;
  color: #9a9a9a;
}
.loginAgreement .tab > p {
  font-size: 0.4256rem;
  font-weight: 500;
}
/* 内容 */
.content {
  padding: 0.3325rem 0.5054rem 0;
  font-size: 0.4rem;
  line-height: 0.6rem;
}
.content p {
  margin-bottom: 0.8rem;
}
</style>